Identifier: com.github.woodleighschool.jamf.OutsetApplyBranding
ParentRecipe: com.github.woodleighschool.pkg.OutsetApplyBranding

Input:
  NAME: Outset Apply Branding
  CATEGORY: New DEP

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
      replace_pkg: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: "%NAME%"
      versions_to_keep: 1
