Identifier: com.github.woodleighschool.download.BambuStudio

Input:
  NAME: BambuStudio
  PRERELEASE: ""

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: bambulab/BambuStudio
      include_prereleases: "%PRERELEASE%"
      asset_regex: '[\S]+\.dmg'
      result_output_var_name: version

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/BambuStudio.app"
      requirement: >-
        identifier "com.bambulab.bambu-studio" and anchor apple generic and
        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
        certificate leaf[subject.OU] = "T3UBR9Y3B2"
