Identifier: com.github.woodleighschool.jamf.BambuStudio
ParentRecipe: com.github.woodleighschool.pkg.BambuStudio

Input:
  NAME: BambuStudio
  CATEGORY: STEAM
  POLICY_NAME: ALL - %NAME% - ALL
  SELF_SERVICE_DESCRIPTION: >
    Bambu Studio is an open-source, cutting-edge, feature-rich slicing software.
    It contains project-based workflows, systematically optimized slicing
    algorithms, and an easy-to-use graphical interface, bringing users an
    incredibly smooth printing experience.

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"

  - Processor: com.github.woodleighschool.processors/JamfPolicyXMLGenerator
    Arguments:
      general:
        policy_name: "%POLICY_NAME%"
        policy_category: Self Service
        frequency: Ongoing
        trigger_other: "%NAME%"
      scope:
        all_computers: true
      self_service:
        show: true
        display_name: "%NAME%"
        description: "%SELF_SERVICE_DESCRIPTION%"
        categories:
          - name: "%CATEGORY%"
            display_in: true
            feature_in: false
      maintenance:
      files_processes:
      user_interaction:
      output: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: "%NAME%.png"
      policy_name: "%POLICY_NAME%"
      policy_template: "%RECIPE_CACHE_DIR%/%NAME%.xml"
      replace_policy: "True"
      replace_icon: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: "%NAME%"
      versions_to_keep: 1
