Identifier: com.github.woodleighschool.jamf.CricutDesignSpace
ParentRecipe: com.github.woodleighschool.pkg.CricutDesignSpace

Input:
  NAME: Cricut Design Space
  CATEGORY: Creative & Design
  POLICY_NAME: ALL - %NAME% - ALL
  SELF_SERVICE_DESCRIPTION: >
    Enjoy total creative freedom over your next DIY project with Cricut Design Space™. Design, cut, or draw by connecting to Cricut Explore™ or Cricut Maker™ machines.
    Start your project from scratch or browse thousands of images, ready-to-make projects, and unique fonts in the Cricut Image Library.

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"

  - Processor: com.github.woodleighschool.processors/JamfPolicyXMLGenerator
    Arguments:
      general:
        policy_name: "%POLICY_NAME%"
        policy_category: Self Service
        frequency: Ongoing
        trigger_other: "%NAME%"
      scope:
        all_computers: true
      self_service:
        show: true
        display_name: "%NAME%"
        description: "%SELF_SERVICE_DESCRIPTION%"
        categories:
          - name: "%CATEGORY%"
            display_in: true
            feature_in: false
      maintenance:
      files_processes:
      user_interaction:
      output: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: "%NAME%.png"
      policy_name: "%POLICY_NAME%"
      policy_template: "%RECIPE_CACHE_DIR%/%NAME%.xml"
      replace_policy: "True"
      replace_icon: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: "%NAME%"
      versions_to_keep: 1
