Identifier: com.github.woodleighschool.download.CricutDesignSpace

Input:
  NAME: Cricut Design Space

Process:
  - Processor: com.github.woodleighschool.processors/SimpleJSONParser
    Arguments:
      json_url: >-
        https://apis.cricut.com/desktopdownload/UpdateJson?operatingSystem=osxnative&shard=a
      json_key: result

  - Processor: com.github.woodleighschool.processors/SimpleJSONParser
    Arguments:
      json_url: "%json_value%"
      json_key: rolloutInstallFile

  - Processor: com.github.woodleighschool.processors/SimpleJSONParser
    Arguments:
      json_url: >-
        https://apis.cricut.com/desktopdownload/InstallerFile?shard=a&operatingSystem=osxnative&fileName=%json_value%
      json_key: result

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.dmg"
      url: "%json_value%"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/%NAME%.app"
      requirement: >-
        identifier "com.cricut.design" and anchor apple generic and certificate
        1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate
        leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate
        leaf[subject.OU] = "25627ZFVT7"
