Identifier: com.github.woodleighschool.pkg.OutsetSetupYourMacCaller

Input:
  NAME: Outset SetupYourMac Caller
  version: "1.0"

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
      pkgdirs:
        usr: "0775"

  - Processor: com.github.woodleighschool.processors/FolderCreator
    Arguments:
      folders:
        - path: "%RECIPE_CACHE_DIR%/%NAME%/ROOT/usr/local/outset/login-privileged-once"
          perms: "0755"

  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/%NAME%/ROOT/usr/local/outset/login-privileged-once/SetupYourMac.sh"
      file_mode: "0755"
      file_content: |
        #!/bin/bash
        jamf policy -event setupyourmac

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%version%"
        version: "%version%"
        id: "com.woodleigh.symcaller"
        options: purge_ds_store
        pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
        chown:
          - path: usr
            user: root
            group: admin

  - Processor: com.github.woodleighschool.processors/PkgSigner
    Arguments:
      signing_cert: "Developer ID Installer: Woodleigh School (SMLKBTR495)"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%NAME%"
