Identifier: com.github.woodleighschool.jamf.WindowsApp
ParentRecipe: com.github.woodleighschool.pkg.WindowsApp

Input:
  NAME: Windows App
  CATEGORY: Productivity & Office
  POLICY_NAME: ALL - %NAME% - STAFF
  SELF_SERVICE_DESCRIPTION: >
    Windows App (formerly Microsoft Remote Desktop) is your gateway to Azure Virtual Desktop, Windows 365, Microsoft Dev Box, Remote Desktop Services, and remote PCs, securely connecting you to Windows devices and apps.

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"

  - Processor: com.github.woodleighschool.processors/JamfPolicyXMLGenerator
    Arguments:
      version: "%version%"
      general:
        policy_name: "%POLICY_NAME%"
        policy_category: Applications
        frequency: Ongoing
        trigger_other: "%NAME%"
      scope:
        all_computers: False
        include:
          departments:
            - id: 11
              name: "Staff"
            - id: 21
              name: "IT"
      package:
      self_service:
        show: True
        display_name: "%NAME%"
        description: "%SELF_SERVICE_DESCRIPTION%"
        categories:
          - name: "%CATEGORY%"
            display_in: True
            feature_in: False
      maintenance:
      files_processes:
#        run_command: killall 'Windows App' || echo && loggedInUser=$(/bin/ls -l /dev/console | /usr/bin/awk '{ print $3 }') && hostAddress="rds.woodleigh.vic.edu.au" && friendlyName="RDS" && uuid=$(existingUUID=$(sudo -u "${loggedInUser}" "/Applications/Windows App.app/Contents/MacOS/Windows App" --script bookmark list | grep "\"${friendlyName}\"" | awk -F ', ' '{print $2}') && echo "${existingUUID:-$(uuidgen)}") && sudo -u "${loggedInUser}" "/Applications/Windows App.app/Contents/MacOS/Windows App" --script bookmark write "${uuid}" --hostname "${hostAddress}" --friendlyname "${friendlyName}" --redirectprinters true --username "${loggedInUser}"
      user_interaction:
      output: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: "%NAME%.png"
      policy_name: "%POLICY_NAME%"
      policy_template: "%RECIPE_CACHE_DIR%/%NAME%.xml"
      replace_policy: "True"
      replace_icon: "True"

#  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
#    Arguments:
#      enabled: "True"
#      patch_softwaretitle: "%NAME%"
#      patch_name: "%NAME% - Notify"
#      patch_template: "PolicyPatchTemplateNotify.xml"
#      patch_icon_policy_name: "%POLICY_NAME%"
#      grace_period_duration: "60"
#      patch_unknown: "true"
#      min_os: ""
#      kill_app_name: ""
#      kill_app_bundle_id: ""
#      replace_patch: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: "%NAME%"
      versions_to_keep: 1
