Identifier: com.github.woodleighschool.download.DockerDesktop

Input:
  NAME: Docker Desktop
  DOWNLOAD_URL: "https://desktop.docker.com/mac/main/arm64/Docker.dmg"

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%"
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Docker.app"
      requirement: >-
        identifier "com.docker.docker" and anchor apple generic and
        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
        certificate leaf[subject.OU] = "9BNSXJN65R"
