
Identifier: com.github.woodleighschool.download.UnityHub

Input:
  NAME: Unity Hub
  DOWNLOAD_URL: "https://public-cdn.cloud.unity3d.com/hub/prod/UnityHubSetup.dmg"

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%"
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/%NAME%.app"
      requirement: >-
        identifier "com.unity3d.unityhub" and anchor apple generic
        and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */
        and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */
        and certificate leaf[subject.OU] = BVPN9UFA9B
