Identifier: com.github.woodleighschool.jamf.UnityHub
ParentRecipe: com.github.woodleighschool.pkg.UnityHub

Input:
  NAME: Unity Hub
  CATEGORY: Development & Programming
  POLICY_NAME: ALL - %NAME% - ALL
  SELF_SERVICE_DESCRIPTION: >
    With Unity Hub start new projects using powerful templates. You can manage all of your Unity Projects and Editor installations. With a new look, you can customize your workflow, share and collaborate with your team, and more!

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
      replace_pkg: True #

  - Processor: com.github.woodleighschool.processors/JamfPolicyXMLGenerator
    Arguments:
      general:
        policy_name: "%POLICY_NAME%"
        policy_category: Applications
        frequency: Ongoing
        trigger_other: "%NAME%"
      scope:
        all_computers: True
      package:
      self_service:
        show: True
        display_name: "%NAME%"
        description: "%SELF_SERVICE_DESCRIPTION%"
        categories:
          - name: "%CATEGORY%"
            display_in: True
            feature_in: False
      maintenance:
      files_processes:
      user_interaction:
      output: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: "%NAME%.png"
      policy_name: "%POLICY_NAME%"
      policy_template: "%RECIPE_CACHE_DIR%/%NAME%.xml"
      replace_policy: "True"
      replace_icon: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
    Arguments:
      enabled: "true"
      patch_softwaretitle: "%NAME%"
      patch_name: "%NAME% - Force"
      patch_template: "PolicyPatchTemplateForce.xml"
      patch_icon_policy_name: "%POLICY_NAME%"
      grace_period_duration: "60"
      min_os: ""
      kill_app_name: ""
      kill_app_bundle_id: ""
      replace_patch: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: "%NAME%"
      versions_to_keep: 1