Identifier: com.github.woodleighschool.pkg.XCreds

Input:
  NAME: XCreds

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
      pkgdirs:
        Applications: "0775"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Assets/%NAME%.app"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%/ROOT/Applications/%NAME%.app"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Scripts"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%/Scripts"

  - Processor: com.github.woodleighschool.processors/FolderCreator
    Arguments:
      folders:
        - path: "%RECIPE_CACHE_DIR%/%NAME%/ROOT/Library/LaunchAgents"
          perms: "0755"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Assets/com.twocanoes.XCreds.plist"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%/ROOT/Library/LaunchAgents/com.twocanoes.XCreds.plist"

  - Processor: PlistReader
    Arguments:
      info_path: "%RECIPE_CACHE_DIR%/%NAME%/ROOT/Applications/%NAME%.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%version%"
        version: "%version%"
        id: "com.twocanoes.xcreds"
        options: purge_ds_store
        scripts: "%RECIPE_CACHE_DIR%/%NAME%/Scripts"
        pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
        chown:
          - path: Applications
            user: root
            group: admin

#  - Processor: com.github.woodleighschool.processors/PkgSigner
#    Arguments:
#      signing_cert: "Developer ID Installer: Woodleigh School (SMLKBTR495)"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%NAME%"
