Identifier: com.github.woodleighschool.jamf.XCreds
ParentRecipe: com.github.woodleighschool.pkg.XCreds

Input:
  NAME: XCreds
  CATEGORY: Applications
  POLICY_NAME: ALL - %NAME% - ALL
  SELF_SERVICE_DESCRIPTION: >
    XCreds is the new version of NoMAD, do not install manually!
    
Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
      replace_pkg: "True"

  - Processor: com.github.woodleighschool.processors/JamfPolicyXMLGenerator
    Arguments:
      general:
        policy_name: "%POLICY_NAME%"
        policy_category: Applications
        frequency: Ongoing
        trigger_other: "%NAME%"
      scope:
        all_computers: True
      package:
      self_service:
        show: True
        display_name: "%NAME%"
        description: "%SELF_SERVICE_DESCRIPTION%"
        categories:
          - name: "%CATEGORY%"
            display_in: True
            feature_in: False
      maintenance:
      files_processes:
      user_interaction:
      output: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: "%NAME%.png"
      policy_name: "%POLICY_NAME%"
      policy_template: "%RECIPE_CACHE_DIR%/%NAME%.xml"
      replace_policy: "True"
      replace_icon: "True"

#  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
#    Arguments:
#      enabled: "true"
#      patch_softwaretitle: "%NAME%"
#      patch_name: "%NAME% - Force"
#      patch_template: "PolicyPatchTemplateForce.xml"
#      patch_icon_policy_name: "%POLICY_NAME%"
#      grace_period_duration: "1"
#      min_os: ""
#      kill_app_name: ""
#      kill_app_bundle_id: ""
#      replace_patch: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: "%NAME%"
      versions_to_keep: 1
