Identifier: com.github.woodleighschool.pkg.XCreds

Input:
  NAME: XCreds

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
      pkgdirs:
        Applications: "0775"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Assets/%NAME%.app"
      destination_path: "%pkgroot%/Applications/%NAME%.app"
      overwrite: True

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Assets/Library"
      destination_path: "%pkgroot%/Library"
      overwrite: True

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Scripts"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%/Scripts"
      overwrite: True

  - Processor: PlistReader
    Arguments:
      info_path: "%pkgroot%/Applications/%NAME%.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%version%"
        version: "%version%"
        id: "com.twocanoes.xcreds"
        options: purge_ds_store
        scripts: "%RECIPE_CACHE_DIR%/%NAME%/Scripts"
        pkgroot: "%pkgroot%"
        chown:
          - path: Applications
            user: root
            group: admin
          - path: Library
            user: root
            group: wheel

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%NAME%"
