Identifier: com.github.woodleighschool.pkg.GoogleEarthPro
ParentRecipe: com.github.woodleighschool.download.GoogleEarthPro

Input:
  NAME: Google Earth Pro

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%pathname%/Install Google Earth*.pkg"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/payload"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/Google_Earth_Pro.pkg/Payload"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/payload/%NAME%.app/Contents/Info.plist"
      plist_version_key: "CFBundleVersion"

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%/Install Google Earth*.pkg"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/payload"
        - "%RECIPE_CACHE_DIR%/unpack"
