Identifier: com.github.woodleighschool.download.UltiMakerCura
Input:
  NAME: UltiMaker Cura
  PRERELEASE: ""
Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: Ultimaker/Cura
      include_prereleases: "%PRERELEASE%"
      asset_regex: '[\S]+\.pkg'
      result_output_var_name: version
  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.pkg"
      url: "%url%"
  - Processor: EndOfCheckPhase
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
