Identifier: com.github.woodleighschool.pkg.UltiMakerCura
ParentRecipe: com.github.woodleighschool.download.UltiMakerCura
Input:
  NAME: UltiMaker Cura
Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%"
  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%pathname%"
