Identifier: com.github.woodleighschool.download.MicrosoftTeams

Input:
  NAME: Microsoft Teams

Process:
  - Processor: com.github.woodleighschool.processors/Microsoft365VersionerGetter
    Arguments:
      package_id: "com.microsoft.teams2.standalone"

  - Processor: URLDownloader
    Arguments:
      url: "%download_url%"
      filename: "%NAME%-%version%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
      expected_authority_names:
        - "Developer ID Installer: Microsoft Corporation (UBF8T346G9)"
        - "Developer ID Certification Authority"
        - "Apple Root CA"
