Identifier: com.github.woodleighschool.download.Outset

Input:
  NAME: Outset
  PRERELEASE: ""

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: macadmins/outset
      include_prereleases: "%PRERELEASE%"
      asset_regex: '[\S]+\.pkg'
      result_output_var_name: version

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%-%version%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"

  - Processor: FileMover
    Arguments:
      source: "%pathname%"
      target: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"