Identifier: com.github.woodleighschool.pkg.OutsetScripts

Input:
  NAME: Outset Scripts
  version: "2.5"

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
      pkgdirs:
        usr: "0755"
        Library: "0755"

  - Processor: com.github.woodleighschool.processors/FolderCreator
    Arguments:
      folders:
        - path: "%pkgroot%/usr/local/"
          perms: "0755"
        - path: "%pkgroot%/Library/Desktop Pictures"
          perms: "0755"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Assets/outset"
      destination_path: "%pkgroot%/usr/local/outset"
      overwrite: True

  - Processor: FileCreator
    Arguments:
      file_path: "%pkgroot%/usr/local/outset/version"
      file_content: "%version%"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Assets/Woodleigh.jpg"
      destination_path: "%pkgroot%/Library/Desktop Pictures/Woodleigh.jpg"
      overwrite: True

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%version%"
        version: "%version%"
        id: "com.woodleigh.outsetscripts"
        options: purge_ds_store
        scripts: "%RECIPE_DIR%/Scripts"
        pkgroot: "%pkgroot%"
        chown:
          - path: usr
            user: root
            group: wheel
          - path: Library
            user: root
            group: wheel

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%NAME%"
