
Identifier: com.github.woodleighschool.pkg.WacomTabletDriver
ParentRecipe: com.github.woodleighschool.download.WacomTabletDriver

Input:
  NAME: Wacom Tablet Driver

Process:
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%/Install Wacom Tablet.pkg"



