Identifier: com.github.woodleighschool.download.WacomTabletDriver

Input:
  NAME: Wacom Tablet Driver

Process:
  - Processor: URLTextSearcher
    Arguments:
      url: https://www.wacom.com/en-us/support/product-support/drivers
      re_pattern: '(?P<url>https:\/\/cdn\.wacom\.com\/u\/productsupport\/drivers\/mac\/professional\/WacomTablet_(?P<version>[\d.-]+)\.dmg)'

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Install Wacom Tablet.pkg"
      requirement: >-
        Developer ID Installer: Wacom Technology Corp. (EG27766DY7)
        Developer ID Certification Authority
        Apple Root CA
