
Identifier: com.github.woodleighschool.pkg.VernierGraphicalAnalysis
ParentRecipe: com.github.woodleighschool.download.VernierGraphicalAnalysis

Input:
  NAME: Vernier Graphical Analysis

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
      pkgdirs:
        Applications: "0775"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/%NAME%.app"
      destination_path: "%pkgroot%/Applications/%NAME%.app"
      overwrite: True

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%version%"
        version: "%version%"
        id: "%bundleid%"
        options: purge_ds_store
        pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
        chown:
          - path: Applications
            user: root
            group: admin

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%NAME%"
