Identifier: com.github.woodleighschool.download.MicrosoftOneDrive

Input:
  NAME: Microsoft OneDrive

Process:
  - Processor: URLDownloader
    Arguments:
      url: "https://go.microsoft.com/fwlink/?linkid=823060"
      filename: "%NAME%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
      expected_authority_names:
        - "Developer ID Installer: Microsoft Corporation (UBF8T346G9)"
        - "Developer ID Certification Authority"
        - "Apple Root CA"
