Identifier: com.github.woodleighschool.download.Vivi

Input:
  NAME: Vivi
  DOWNLOAD_URL: "https://api.vivi.io/mac"

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%"
      filename: "%NAME%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
