Identifier: com.github.woodleighschool.download.Audacity

Input:
  NAME: Audacity
  ARCHITECTURE: arm64
  PRERELEASE: ""

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: "audacity-macOS-(\\d(\\.\\d)+)-%ARCHITECTURE%\\.dmg"
      github_repo: "audacity/audacity"
      include_prereleases: "%PRERELEASE%"

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Audacity.app"
      requirement: >-
        identifier "org.audacityteam.audacity" and anchor apple generic and
        certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
        certificate leaf[subject.OU] = AWEYX923UX
