Identifier: com.github.woodleighschool.jamf.MinecraftEducation
ParentRecipe: com.github.woodleighschool.pkg.MinecraftEducation

Input:
  NAME: Minecraft Education
  CATEGORY: STEAM
  POLICY_NAME: ALL - %NAME% - ALL
  SELF_SERVICE_DESCRIPTION: >
    Engage students in game-based learning across the curriculum. Minecraft
    Education is a game-based platform that inspires creative, inclusive
    learning through play. Explore blocky words that unlock new ways to take on
    any subject or challenge.

    Version: %version%
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"

  - Processor: com.github.woodleighschool.processors/JamfPolicyXMLGenerator
    Arguments:
      general:
        policy_name: "%POLICY_NAME%"
        policy_category: Self Service
        custom_event: "%NAME%"
      scope:
        all_computers: false
        include:
          computer_groups:
            - id: 68
              name: "Penbank Campus - Students"
            - id: 15
              name: "Senior Campus - Students"
          departments:
            - id: 11
              name: "Staff"
            - id: 21
              name: "IT"
      self_service:
        install_button_text: "Install"
        reinstall_button_text: "Reinstall"
        display_name: "%NAME%"
        description: "%SELF_SERVICE_DESCRIPTION%"
        categories:
          - name: "%CATEGORY%"
            display_in: true
            feature_in: true
      maintenance:
        recon: true
      user_interaction:
        message_start: "%NAME% is being installed."
        message_finish: "%NAME% has now been installed."
      output: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: "%NAME%.png"
      policy_name: "%POLICY_NAME%"
      policy_template: "%RECIPE_CACHE_DIR%/%NAME%.xml"
      replace_policy: "True"
      replace_icon: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: "%NAME%"
      versions_to_keep: 1
