Identifier: com.github.woodleighschool.download.MinecraftEducation

Input:
  NAME: Minecraft Education

Process:
  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.dmg"
      url: "https://aka.ms/meeclientmacos"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/minecraftpe.app"
      requirement: >-
        identifier "com.microsoft.minecraftpe" and anchor apple generic and
        certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
        certificate leaf[subject.OU] = UBF8T346G9
