Identifier: com.github.woodleighschool.pkg.GoogleChrome
ParentRecipe: com.github.woodleighschool.download.GoogleChrome
Input:
  NAME: Google Chrome
Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%pathname%"
  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/GoogleChrome.pkg/Payload"
  - Processor: PlistReader
    Arguments:
      info_path: "%RECIPE_CACHE_DIR%/unpack/%NAME%.app"
  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%"
  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%pathname%"
