Identifier: com.github.woodleighschool.download.Microsoft365BusinessProSuite

Input:
  NAME: Microsoft 365 Suite

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: Version (\*|\d+(\.\d+){0,2}(\.\*)?)
      url: https://learn.microsoft.com/en-us/officeupdates/release-notes-office-for-mac
      result_output_var_name: version

  - Processor: URLDownloader
    Arguments:
      url: "https://go.microsoft.com/fwlink/?linkid=2009112"
      filename: "%NAME%-%version%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
      expected_authority_names:
        - "Developer ID Installer: Microsoft Corporation (UBF8T346G9)"
        - "Developer ID Certification Authority"
        - "Apple Root CA"
