Identifier: com.github.woodleighschool.pkg.GlobalProtect
ParentRecipe: com.github.woodleighschool.download.GlobalProtect

Input:
  NAME: GlobalProtect

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      flat_pkg_path: "%pathname%"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/payload"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/unpack/gp.pkg/Payload"

  - Processor: PlistReader
    Arguments:
      info_path: "%RECIPE_CACHE_DIR%/payload/Contents/Info.plist"

  - Processor: PkgCopier
    Arguments:
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      source_pkg: "%pathname%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/payload"
        - "%RECIPE_CACHE_DIR%/unpack"
