Identifier: com.github.woodleighschool.jamf.MicrosoftRemoteDesktop
ParentRecipe: com.github.woodleighschool.download.MicrosoftRemoteDesktop

Input:
  NAME: Microsoft Remote Desktop
  CATEGORY: Productivity & Office
  POLICY_NAME: ALL - %NAME% - STAFF
  SELF_SERVICE_DESCRIPTION: >
    Use Microsoft Remote Desktop for Mac to connect to Azure Virtual Desktop, Windows 365, admin-provided virtual apps and desktops, or remote PCs. With Microsoft Remote Desktop, you can be productive no matter where you are.

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"

  - Processor: com.github.woodleighschool.processors/JamfPolicyXMLGenerator
    Arguments:
      version: "%shortversion%"
      general:
        policy_name: "%POLICY_NAME%"
        policy_category: Self Service
        frequency: Ongoing
        trigger_other: "%NAME%"
      scope:
        all_computers: false
        include:
          departments:
            - id: 11
              name: "Staff"
            - id: 21
              name: "IT"
      self_service:
        show: true
        display_name: "%NAME%"
        description: "%SELF_SERVICE_DESCRIPTION%"
        categories:
          - name: "%CATEGORY%"
            display_in: true
            feature_in: false
      maintenance:
      files_processes:
      user_interaction:
      output: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: "%NAME%.png"
      policy_name: "%POLICY_NAME%"
      policy_template: "%RECIPE_CACHE_DIR%/%NAME%.xml"
      replace_policy: "True"
      replace_icon: "True"

  #  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
  #    Arguments:
  #      enabled: "true"
  #      patch_softwaretitle: "%NAME%"
  #      patch_name: "%NAME% - Notify"
  #      patch_template: "PolicyPatchTemplateNotify.xml"
  #      patch_icon_policy_name: "%POLICY_NAME%"
  #      min_os: ""
  #      kill_app_name: ""
  #      kill_app_bundle_id: ""
  #      replace_patch: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: "%NAME%"
      versions_to_keep: 1
