
Identifier: com.github.woodleighschool.jamf.GarageBand
ParentRecipe: com.github.woodleighschool.pkg.GarageBand

Input:
  NAME: GarageBand
  CATEGORY: Creative & Design
  POLICY_NAME: ALL - %NAME% - ALL
  SELF_SERVICE_DESCRIPTION: >
    GarageBand is the easiest way to create a great-sounding song on your Mac. Add realistic, impeccably produced and performed drum grooves to your song with Drummer. Easily shape the sound of any instrument in the Sound Library with Smart Controls. Crank up the bottom end with Bass Amp Designer, or mix and match electric guitar amps, cabinets, and pedals with Amp Designer and Pedalboard. Control GarageBand and play any software instrument wirelessly on your iPad using the Logic Remote app. Use iCloud to keep your GarageBand projects updated across multiple Mac computers, or even import GarageBand for iOS songs directly from iCloud.

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"

  - Processor: com.github.woodleighschool.processors/JamfPolicyXMLGenerator
    Arguments:
      general:
        policy_name: "%POLICY_NAME%"
        policy_category: Applications
        frequency: Ongoing
        trigger_other: "%NAME%"
      scope:
        all_computers: True
      package:
      self_service:
        show: True
        display_name: "%NAME%"
        description: "%SELF_SERVICE_DESCRIPTION%"
        categories:
          - name: "%CATEGORY%"
            display_in: True
            feature_in: False
      maintenance:
      files_processes:
      user_interaction:
      output: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: "%NAME%.png"
      policy_name: "%POLICY_NAME%"
      policy_template: "%RECIPE_CACHE_DIR%/%NAME%.xml"
      replace_policy: "True"
      replace_icon: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
    Arguments:
      enabled: "true"
      patch_softwaretitle: "%NAME%"
      patch_name: "%NAME% - Force"
      patch_template: "PolicyPatchTemplateForce.xml"
      patch_icon_policy_name: "%POLICY_NAME%"
      grace_period_duration: "60"
      patch_unknown: "true"
      min_os: ""
      kill_app_name: ""
      kill_app_bundle_id: ""
      replace_patch: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: "%NAME%"
      versions_to_keep: 1

