Identifier: com.github.woodleighschool.pkg.OutsetSudoLock

Input:
  NAME: Outset SudoLock

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
      pkgdirs:
        usr: "0755"

  - Processor: com.github.woodleighschool.processors/FolderCreator
    Arguments:
      folders:
        - path: "%RECIPE_CACHE_DIR%/%NAME%/ROOT/usr/local/outset/login-privileged-every"
          perms: "0755"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Assets/SudoLock.sh"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%/ROOT/usr/local/outset/login-privileged-every/SudoLock.sh"
      overwrite: true

  - Processor: com.github.woodleighschool.processors/Permer
    Arguments:
      chown:
        - path: "%RECIPE_CACHE_DIR%/%NAME%/ROOT/usr/local/outset/login-privileged-every/SudoLock.sh"
          perms: "0755"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%"
        version: "1"
        id: "com.woodleigh.outsetsudolock"
        options: purge_ds_store
        pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
        chown:
          - path: usr
            user: root
            group: wheel

  #  - Processor: com.github.woodleighschool.processors/PkgSigner
  #    Arguments:
  #      signing_cert: "Developer ID Installer: Woodleigh School (SMLKBTR495)"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%NAME%"
