Identifier: com.github.woodleighschool.download.Python

Input:
  MAJVERSION: "3.12" # rectify postinstall if version change !!!!!
  MINVERSION: "4"    # ^
  VERSION: "%MAJVERSION%.%MINVERSION%"
  NAME: "Python %MAJVERSION%"
  DOWNLOAD_URL: "https://www.python.org/ftp/python/%VERSION%/python-%VERSION%-macos11.pkg"

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%"
      filename: "Python-%MAJVERSION%.%MINVERSION%.pkg"

  - Processor: EndOfCheckPhase
