Identifier: com.github.woodleighschool.pkg.Spotify
ParentRecipe: com.github.woodleighschool.download.Spotify

Input:
  NAME: Spotify

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"
      pkgdirs:
        Applications: "0775"

  - Processor: Copier
    Arguments:
      source_path: "%pathname%/%app_name%"
      destination_path: "%pkgroot%/Applications/%app_name%"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%version%"
        version: "%version%"
        id: "%bundleid%"
        options: purge_ds_store
        chown:
          - path: Applications
            user: root
            group: admin

#  - Processor: com.github.woodleighschool.processors/PkgSigner
#    Arguments:
#      signing_cert: "Developer ID Installer: Woodleigh School (SMLKBTR495)"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%pkgroot%"
        - "%pathname%"
