Identifier: com.github.woodleighschool.download.Spotify

Input:
  NAME: Spotify
  DOWNLOAD_URL: "https://download.scdn.co/SpotifyARM64.dmg"

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%"
      filename: "%NAME%.dmg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/%NAME%.app"
      requirement: >-
        identifier "com.spotify.client" and anchor apple generic and
        certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
        certificate leaf[subject.OU] = "2FNC3A47ZF"
