Identifier: com.github.woodleighschool.pkg.Spotify
ParentRecipe: com.github.woodleighschool.download.Spotify

Input:
  NAME: Spotify

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: com.github.woodleighschool.processors/VersionSanitizer
    Arguments:
      pattern: "x.x.xx.xxxx"

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
      pkgdirs:
        tmp: "0777"

  - Processor: com.github.woodleighschool.processors/FolderCreator
    Arguments:
      folders:
        - path: "%pkgroot%/tmp/spotifytemp"
          perms: "0755"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%-ARM64.dmg/%NAME%.app"
      destination_path: "%pkgroot%/tmp/spotifytemp/%NAME%-ARM64.app"
      overwrite: True

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%-Intel.dmg/%NAME%.app"
      destination_path: "%pkgroot%/tmp/spotifytemp/%NAME%-Intel.app"
      overwrite: True

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Scripts"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%/Scripts"
      overwrite: True

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%version%"
        version: "%version%"
        id: "%bundleid%"
        options: purge_ds_store
        scripts: "%RECIPE_CACHE_DIR%/%NAME%/Scripts"
        pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
        chown:
          - path: tmp
            user: root
            group: wheel

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%NAME%"
