Identifier: com.github.woodleighschool.download.LinewizeConnect

Input:
  NAME: Linewize Connect
  DOWNLOAD_URL: "https://s3-ap-southeast-2.amazonaws.com/fz-mza-update-files/PRD/MAC-V3/Connect%20Installer.pkg"

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%"
      filename: "%NAME%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
      expected_authority_names:
        - "Developer ID Installer: B Communications Pty Ltd (5S77G864UH)"
        - "Developer ID Certification Authority"
        - "Apple Root CA"