Identifier: com.github.woodleighschool.pkg.LinewizeConnect
ParentRecipe: com.github.woodleighschool.download.LinewizeConnect

Input:
  NAME: Linewize Connect

Process:
  - Processor: FlatPkgUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/expand"
      flat_pkg_path: "%pathname%"

  - Processor: PkgPayloadUnpacker
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/unpack"
      pkg_payload_path: "%RECIPE_CACHE_DIR%/expand/payload.pkg/Payload"

  - Processor: PlistReader
    Arguments:
      info_path: "%RECIPE_CACHE_DIR%/unpack/Contents/Info.plist"
    
  - Processor: com.github.woodleighschool.processors/VersionSanitizer
    Arguments:
      pattern: "x.x.x"
 
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
      pkgdirs:
        tmp: "0777"

  - Processor: com.github.woodleighschool.processors/FolderCreator
    Arguments:
      folders:
        - path: "%pkgroot%/tmp/connecttemp"
          perms: "0755"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Assets/auth_agent.woodleigh_vic_familyzone.pkg"
      destination_path: "%pkgroot%/tmp/connecttemp/auth_agent.woodleigh_vic_familyzone.pkg"
      overwrite: True

  - Processor: Copier
    Arguments:
      source_path: "%pathname%"
      destination_path: "%pkgroot%/tmp/connecttemp/Connect.pkg"
      overwrite: True

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Scripts"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%/Scripts"
      overwrite: True

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%version%"
        version: "%version%"
        id: "com.woodleigh.connect.installer"
        options: purge_ds_store
        scripts: "%RECIPE_CACHE_DIR%/%NAME%/Scripts"
        pkgroot: "%pkgroot%"
        chown:
          - path: tmp
            user: root
            group: wheel

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"
        - "%RECIPE_CACHE_DIR%/expand"
