Identifier: com.github.woodleighschool.download.SetupYourMac

Input:
  NAME: SetupYourMac
  DOWNLOAD_URL: "https://github.com/woodleighschool/Setup-Your-Mac"

Process:
  - Processor: com.github.woodleighschool.processors/GitRepoCloner
    Arguments:
      repo_url: "%DOWNLOAD_URL%"
      destination_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%"

  - Processor: EndOfCheckPhase