Identifier: com.github.woodleighschool.jamf.swiftDialog
ParentRecipe: com.github.woodleighschool.download.swiftDialig

Input:
  NAME: swiftDialog
  CATEGORY: New DEP
  POLICY_NAME: ALL - %NAME% - ALL

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
      replace_pkg: True