Identifier: com.github.woodleighschool.download.swiftDialig

Input:
  NAME: swiftDialig
  PRERELEASE: ""

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      github_repo: swiftDialog/swiftDialog
      include_prereleases: "%PRERELEASE%"
      asset_regex: '[\S]+\.pkg'
      result_output_var_name: version

  - Processor: com.github.woodleighschool.processors/VersionSanitizer
    Arguments:
      pattern: "x.x.x"

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%-%version%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"

  - Processor: FileMover
    Arguments:
      source: "%pathname%"
      target: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"