Identifier: com.github.woodleighschool.jamf.1Password
ParentRecipe: com.github.woodleighschool.pkg.1Password

Input:
  NAME: 1Password
  CATEGORY: Applications
  POLICY_NAME: ALL - %NAME% - ALL
  SELF_SERVICE_DESCRIPTION: >
    1Password makes it easy to generate, store, and autofill passwords for all your online accounts, on all your devices. Because weak and reused passwords are a leading cause of security incidents, using a password manager is an easy way to protect yourself, your family, or your business.

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"

  - Processor: com.github.woodleighschool.processors/JamfPolicyXMLGenerator
    Arguments:
      general:
        policy_name: "%POLICY_NAME%"
        policy_category: Self Service
        frequency: Ongoing
        trigger_other: "%NAME%"
      scope:
        all_computers: true
      self_service:
        show: true
        display_name: "%NAME%"
        description: "%SELF_SERVICE_DESCRIPTION%"
        categories:
          - name: "%CATEGORY%"
            display_in: true
            feature_in: false
      maintenance:
      files_processes:
      user_interaction:
      output: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      icon: "%NAME%.png"
      policy_name: "%POLICY_NAME%"
      policy_template: "%RECIPE_CACHE_DIR%/%NAME%.xml"
      replace_policy: "True"
      replace_icon: "True"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
    Arguments:
      enabled: "true"
      patch_softwaretitle: "%NAME%"
      patch_name: "%NAME% - Notify"
      patch_template: "PolicyPatchTemplateNotify.xml"
      patch_icon_policy_name: "%POLICY_NAME%"
      min_os: ""
      kill_app_name: ""
      kill_app_bundle_id: ""
      replace_patch: True

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageCleaner
    Arguments:
      pkg_name_match: "%NAME%"
      versions_to_keep: 1
