Identifier: com.github.woodleighschool.download.1Password

Input:
  NAME: 1Password

Process:
  - Processor: URLDownloader
    Arguments:
      url: "https://downloads.1password.com/mac/1Password-latest-x86_64.zip"
      filename: "%NAME%-Intel.zip"

  - Processor: URLDownloader
    Arguments:
      url: "https://downloads.1password.com/mac/1Password-latest-aarch64.zip"
      filename: "%NAME%-ARM64.zip"

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%-Intel.zip"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"

  - Processor: FileMover
    Arguments:
      source: "%RECIPE_CACHE_DIR%/unzip/1Password.app"
      target: "%RECIPE_CACHE_DIR%/unzip/1Password-Intel.app"

  - Processor: Unarchiver
    Arguments:
      archive_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%-ARM64.zip"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"

  - Processor: FileMover
    Arguments:
      source: "%RECIPE_CACHE_DIR%/unzip/1Password.app"
      target: "%RECIPE_CACHE_DIR%/unzip/1Password-ARM64.app"

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/unzip/1Password-ARM64.app"
      requirement: >-
        identifier "com.1password.1password" and
        anchor apple generic and
        certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
        certificate leaf[subject.OU] = "2BUA8C4S2C"
