Identifier: com.github.woodleighschool.pkg.1Password
ParentRecipe: com.github.woodleighschool.download.1Password

Input:
  NAME: 1Password

Process:
  - Processor: PlistReader
    Arguments:
      info_path: "%RECIPE_CACHE_DIR%/unzip/1Password-ARM64.app"

  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
      pkgdirs:
        tmp: "0777"

  - Processor: com.github.woodleighschool.processors/FolderCreator
    Arguments:
      folders:
        - path: "%pkgroot%/tmp/1passwordtemp"
          perms: "0755"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/unzip/1Password-ARM64.app"
      destination_path: "%pkgroot%/tmp/1passwordtemp/%NAME%-ARM64.app"
      overwrite: True

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/unzip/1Password-Intel.app"
      destination_path: "%pkgroot%/tmp/1passwordtemp/%NAME%-Intel.app"
      overwrite: True

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Scripts"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%/Scripts"
      overwrite: True

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%version%"
        version: "%version%"
        id: "com.woodleigh.1password.installer"
        options: purge_ds_store
        scripts: "%RECIPE_CACHE_DIR%/%NAME%/Scripts"
        pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
        chown:
          - path: tmp
            user: root
            group: wheel

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/%NAME%"
        - "%RECIPE_CACHE_DIR%/unzip"
