
Identifier: com.github.woodleighschool.download.EasyFind

Input:
  NAME: EasyFind

Process:
  - Processor: URLDownloader
    Arguments:
      url: "https://download.devontechnologies.com/download/freeware/easyfind/5.0.2/EasyFind.app.zip"
      filename: "%NAME%.zip"

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.zip"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"

#  - Processor: CodeSignatureVerifier
#    Arguments:
#      input_path: "%RECIPE_CACHE_DIR%/unzip/1Password.app"
#      requirement: >-
#        identifier "com.1password.1password" and
#        anchor apple generic and
#        certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
#        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
#        certificate leaf[subject.OU] = "2BUA8C4S2C"
