Identifier: com.github.woodleighschool.pkg.VisualStudioCode
ParentRecipe: com.github.woodleighschool.download.VisualStudioCode

Input:
  NAME: Visual Studio Code

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%/ROOT"
      pkgdirs:
        Applications: "0775"

  - Processor: PlistReader
    Arguments:
      info_path: "%RECIPE_CACHE_DIR%/unzip/%NAME%.app"

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_CACHE_DIR%/unzip/%NAME%.app"
      destination_path: "%pkgroot%/Applications/%NAME%.app"
      overwrite: True

  - Processor: Copier
    Arguments:
      source_path: "%RECIPE_DIR%/Scripts"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%/Scripts"
      overwrite: True

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%version%"
        version: "%version%"
        id: "com.microsoft.vscode"
        options: purge_ds_store
        scripts: "%RECIPE_CACHE_DIR%/%NAME%/Scripts"
        pkgroot: "%pkgroot%"
        chown:
          - path: Applications
            user: root
            group: admin

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPatchUploader
    Arguments:
      enabled: "true"
      patch_softwaretitle: "%NAME%"
      patch_name: "%NAME% - Notify"
      patch_template: "PolicyPatchTemplateNotify.xml"
      patch_icon_policy_name: "%POLICY_NAME%"
      pkg_name: "%NAME%-%version%.pkg"
      min_os: ""
      kill_app_name: ""
      kill_app_bundle_id: ""
      replace_patch: True

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unzip"
        - "%RECIPE_CACHE_DIR%/%NAME%"
