Identifier: com.github.woodleighschool.download.VisualStudioCode

Input:
  NAME: Visual Studio Code
  DOWNLOAD_URL: "https://code.visualstudio.com/sha/download?build=stable&os=darwin-universal"

Process:
  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%"
      filename: "%NAME%.zip"

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.zip"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
      purge_destination: true

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%RECIPE_CACHE_DIR%/unzip/%NAME%.app"
      requirement: >-
        identifier "com.microsoft.VSCode" and anchor apple generic and
        certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
        certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
        certificate leaf[subject.OU] = UBF8T346G9
